{
	"name": "Guidebook: Empowering Girls in STEM",
	"description": {
		"short": "Our guidebook offers practical advice and strategies for parents, educators, and mentors on empowering girls to explore and excel in STEM (Science, Technology, Engineering, and Mathematics) fields. Learn how to inspire the next generation of female scientists, engineers, and innovators.",
		"blurb": "Access our guidebook for tips on encouraging girls to pursue STEM careers.",
		"full": "Guidebook: Empowering Girls in STEM is a comprehensive resource developed by Girls Rising Association to support their target audience of young girls in their mission to empower and uplift through education, mentorship, and leadership opportunities. This guidebook specifically focuses on promoting and encouraging girls' participation and success in the fields of Science, Technology, Engineering, and Mathematics (STEM). The guidebook is designed to provide young girls with the necessary tools, resources, and information to break through stereotypes and barriers that often discourage them from pursuing careers in STEM. It offers valuable insights and strategies to help girls build confidence, develop critical thinking skills, and develop a love for STEM subjects. Through this guidebook, Girls Rising Association encourages girls to challenge themselves and explore their interests in STEM, regardless of any perceived gender biases. It includes practical tips on how to excel in STEM classes, connect with female mentors and role models in the field, and find supportive communities that can help them thrive in their STEM pursuits. Moreover, the guidebook provides a list of scholarships, internships, and other opportunities specifically geared towards empowering girls in STEM. It also features inspiring stories of successful women in STEM, showcasing them as role models for young girls to look up to and aspire to be like. By providing this resource, Girls Rising Association is not only equipping girls with the necessary tools and resources to succeed in STEM but also promoting a more inclusive and diverse workforce in these traditionally male-dominated fields. Guidebook: Empowering Girls in STEM is an essential tool in the organization's efforts to create a brighter future for girls and break down barriers to their success. It is a powerful resource that will empower girls to reach their full potential and make a positive impact in their communities and the world."
	},
	"types": ["publication"],
	"id": "60a149f7-ae35-48eb-9465-e975064d88cc",
	"partner": "f0b4159d-afef-4192-9b7b-584ca89627ad"
}
