{
	"name": "Legal Support for Domestic Violence Survivors",
	"description": {
		"short": "We provide legal support and resources to survivors of domestic violence. Our team of legal experts offers guidance on protective orders, custody matters, and navigating the legal system to ensure the safety and rights of survivors.",
		"blurb": "Access legal support and resources for survivors of domestic violence.",
		"full": "Legal Support for Domestic Violence Survivors is a crucial resource provided by Girls on the Rise for their target audience of young girls and women. Domestic violence is a pervasive issue that affects millions of people worldwide, and unfortunately, many of the victims are young girls and women. This resource aims to empower and protect these survivors by providing them with access to legal support and guidance. One of the most significant challenges for survivors of domestic violence is navigating the complex legal system. They may face barriers such as lack of knowledge about their rights, financial constraints, and fear of retaliation from their abuser. This is where Girls on the Rise steps in to provide crucial support and resources. Through Legal Support for Domestic Violence Survivors, Girls on the Rise offers a range of services to help survivors seek justice and gain control over their lives. This includes connecting them with pro bono lawyers who specialize in domestic violence cases and can provide legal advice and representation. The organization also offers workshops and educational sessions to educate survivors about their legal rights and help them understand the legal process. Furthermore, Girls on the Rise collaborates with local shelters and organizations to provide safe housing and relocation services for survivors who need to escape their abusive situations. This ensures that survivors have a safe place to stay while they navigate the legal system and seek protection. By providing legal support for domestic violence survivors, Girls on the Rise not only fulfills its mission of empowering young girls and women but also plays a crucial role in breaking the cycle of violence. Through this resource, survivors are given the tools and support they need to reclaim their lives and move towards a brighter future."
	},
	"types": ["legal-aid"],
	"id": "c77c494e-60ef-4f32-a34d-7fb3f3ff8225",
	"partner": "72c8de7d-6ad4-45b8-b7cf-11af7c6e6b39"
}
