{
	"name": "Support Group for Survivors of Domestic Violence",
	"description": {
		"short": "Our support group is a safe space for survivors of domestic violence to share their experiences, find healing, and build resilience. We offer a supportive community, counseling, and resources to help survivors on their journey to recovery.",
		"blurb": "Join our support group to connect with survivors and find healing and strength.",
		"full": "Girls Rock Foundation recognizes that domestic violence is a prevalent issue that impacts girls and young women in our society. Many of these individuals may have experienced or witnessed domestic violence in their homes or relationships, leaving them with emotional, physical, and psychological scars. These survivors often face challenges in their personal and professional lives, making it difficult for them to reach their full potential. To address this issue, the Girls Rock Foundation is providing a Support Group for Survivors of Domestic Violence. This resource aims to provide a safe and supportive space for girls and young women who have experienced domestic violence. Through this support group, survivors will be able to connect with others who have gone through similar experiences, share their stories, and receive guidance and support from trained mentors. This support group will offer a holistic approach to healing, focusing on building self-confidence, self-esteem, and resilience. The group will also provide resources and tools to help survivors cope with their trauma and find healthy ways to manage their emotions. Through various activities such as art therapy, mindfulness exercises, and group discussions, participants will gain a better understanding of themselves and learn new strategies to overcome their experiences. Moreover, the Support Group for Survivors of Domestic Violence will also serve as a platform for survivors to voice their concerns and advocate for change. The Girls Rock Foundation believes in empowering girls and young women to become strong and confident individuals who can make a positive impact in their communities. By providing this resource, the foundation hopes to break the cycle of domestic violence and create a supportive community where survivors can heal and thrive. In conclusion, the Support Group for Survivors of Domestic Violence offered by the Girls Rock Foundation plays a vital role in supporting their target audience and fulfilling their mission. Through this resource, survivors will receive the necessary support and resources to achieve their full potential and become confident, resilient, and empowered individuals. The Girls Rock Foundation is committed to making a difference in the lives of these survivors and creating a better, safer future for all girls and young women."
	},
	"types": ["support-group"],
	"id": "356c4770-5a80-4ac9-a5c2-62b6168a921b",
	"partner": "a44ca010-ae99-4e87-9500-ed37f2c7ae6c"
}
