{
	"name": "Guide: Promoting Healthy Relationships",
	"description": {
		"short": "Our comprehensive guide offers insights and resources on promoting healthy, respectful relationships among women and girls. Learn about communication, boundaries, consent, and building fulfilling connections.",
		"blurb": "Access our guide for insights on promoting healthy and respectful relationships.",
		"full": "Guide: Promoting Healthy Relationships is a valuable resource provided by Sisters United to support their target audience of women from all backgrounds. This comprehensive guide is designed to empower, educate, and uplift women by promoting healthy relationships in both their personal and professional lives. The guide covers various topics, including communication, boundaries, and conflict resolution, all of which are crucial for building and maintaining healthy relationships. It also delves into the importance of self-care and setting healthy expectations in relationships. Through this guide, Sisters United aims to equip women with the necessary tools and knowledge to foster healthy relationships with themselves, their partners, family members, and colleagues. By promoting healthy relationships, the organization hopes to strengthen the community as a whole and create a more supportive and uplifting environment for women. In addition to addressing key aspects of relationships, the guide also offers practical tips and exercises for women to implement in their daily lives. These include mindfulness techniques, journaling prompts, and role-playing scenarios to help women develop effective communication skills and build stronger connections with others. Overall, Guide: Promoting Healthy Relationships serves as a vital resource for Sisters United's mission to empower and uplift women. By providing this guide, the organization demonstrates its commitment to promoting positive change and creating a stronger community for all women."
	},
	"types": ["publication"],
	"id": "a44b5aab-be05-41bb-81c8-6849a3513120",
	"partner": "1f3b33d6-8a3f-40c8-9bf9-2f57a28be3c8",
	"isPinned": true,
	"image": "A8E691DDB293408394762A0697CE368B.jpg"
}
